-- phpMyAdmin SQL Dump
-- version 4.0.10.14
-- http://www.phpmyadmin.net
--
-- Client: localhost:3306
-- Généré le: Lun 27 Février 2017 à 03:36
-- Version du serveur: 10.1.18-MariaDB-cll-lve
-- Version de PHP: 5.4.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Base de données: `lbacrea_hpr`
--

-- --------------------------------------------------------

--
-- Structure de la table `competences`
--

CREATE TABLE IF NOT EXISTS `competences` (
  `id` int(10) unsigned NOT NULL,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Contenu de la table `competences`
--

INSERT INTO `competences` (`id`, `nom`, `created_at`, `updated_at`) VALUES
(1, 'Node.JS', '2017-02-27 03:41:25', '2017-02-27 03:41:25'),
(2, 'PHP', '2017-02-27 03:41:25', '2017-02-27 03:41:25'),
(3, 'Java', '2017-02-27 03:41:44', '2017-02-27 03:41:44'),
(4, 'C++', '2017-02-27 03:41:44', '2017-02-27 03:41:44'),
(5, 'Assembly', NULL, NULL),
(6, 'OpenGL', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `competence_choisies`
--

CREATE TABLE IF NOT EXISTS `competence_choisies` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `profile_id` int(11) NOT NULL,
  `competence` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `competence_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=85 ;

--
-- Contenu de la table `competence_choisies`
--

INSERT INTO `competence_choisies` (`id`, `profile_id`, `competence`, `competence_id`, `created_at`, `updated_at`) VALUES
(4, 9, 'Java', 3, '2017-02-27 09:14:34', '2017-02-27 09:14:34'),
(5, 9, 'C++', 4, '2017-02-27 09:14:34', '2017-02-27 09:14:34'),
(6, 9, 'Assembly', 5, '2017-02-27 09:14:34', '2017-02-27 09:14:34'),
(7, 9, 'OpenGL', 6, '2017-02-27 09:14:34', '2017-02-27 09:14:34'),
(8, 10, 'Node.JS', 1, '2017-02-27 09:15:52', '2017-02-27 09:15:52'),
(9, 10, 'Java', 3, '2017-02-27 09:15:52', '2017-02-27 09:15:52'),
(10, 10, 'Assembly', 5, '2017-02-27 09:15:52', '2017-02-27 09:15:52'),
(11, 11, 'PHP', 2, '2017-02-27 09:16:37', '2017-02-27 09:16:37'),
(12, 11, 'C++', 4, '2017-02-27 09:16:37', '2017-02-27 09:16:37'),
(13, 11, 'Assembly', 5, '2017-02-27 09:16:37', '2017-02-27 09:16:37'),
(14, 11, 'OpenGL', 6, '2017-02-27 09:16:37', '2017-02-27 09:16:37'),
(15, 12, 'Java', 3, '2017-02-27 09:17:24', '2017-02-27 09:17:24'),
(16, 12, 'C++', 4, '2017-02-27 09:17:24', '2017-02-27 09:17:24'),
(17, 13, 'Node.JS', 1, '2017-02-27 09:18:13', '2017-02-27 09:18:13'),
(18, 13, 'PHP', 2, '2017-02-27 09:18:13', '2017-02-27 09:18:13'),
(19, 13, 'Assembly', 5, '2017-02-27 09:18:13', '2017-02-27 09:18:13'),
(20, 13, 'OpenGL', 6, '2017-02-27 09:18:13', '2017-02-27 09:18:13'),
(21, 14, 'C++', 4, '2017-02-27 09:19:02', '2017-02-27 09:19:02'),
(22, 15, 'C++', 4, '2017-02-27 09:21:12', '2017-02-27 09:21:12'),
(23, 15, 'Assembly', 5, '2017-02-27 09:21:12', '2017-02-27 09:21:12'),
(24, 16, 'OpenGL', 6, '2017-02-27 09:22:02', '2017-02-27 09:22:02'),
(25, 17, 'Java', 3, '2017-02-27 09:23:28', '2017-02-27 09:23:28'),
(26, 18, 'Node.JS', 1, '2017-02-27 09:25:18', '2017-02-27 09:25:18'),
(27, 18, 'PHP', 2, '2017-02-27 09:25:18', '2017-02-27 09:25:18'),
(28, 19, 'Java', 3, '2017-02-27 09:28:16', '2017-02-27 09:28:16'),
(29, 20, 'C++', 4, '2017-02-27 09:29:46', '2017-02-27 09:29:46'),
(30, 20, 'Assembly', 5, '2017-02-27 09:29:46', '2017-02-27 09:29:46'),
(31, 20, 'OpenGL', 6, '2017-02-27 09:29:46', '2017-02-27 09:29:46'),
(32, 21, 'Node.JS', 1, '2017-02-27 09:30:36', '2017-02-27 09:30:36'),
(33, 21, 'PHP', 2, '2017-02-27 09:30:36', '2017-02-27 09:30:36'),
(34, 21, 'Java', 3, '2017-02-27 09:30:36', '2017-02-27 09:30:36'),
(35, 22, 'OpenGL', 6, '2017-02-27 09:35:24', '2017-02-27 09:35:24'),
(36, 23, 'Node.JS', 1, '2017-02-27 09:36:12', '2017-02-27 09:36:12'),
(37, 24, 'PHP', 2, '2017-02-27 09:36:44', '2017-02-27 09:36:44'),
(38, 24, 'C++', 4, '2017-02-27 09:36:44', '2017-02-27 09:36:44'),
(39, 24, 'OpenGL', 6, '2017-02-27 09:36:44', '2017-02-27 09:36:44'),
(40, 25, 'PHP', 2, '2017-02-27 09:37:35', '2017-02-27 09:37:35'),
(41, 25, 'Assembly', 5, '2017-02-27 09:37:35', '2017-02-27 09:37:35'),
(42, 26, 'Java', 3, '2017-02-27 09:38:01', '2017-02-27 09:38:01'),
(43, 27, 'Node.JS', 1, '2017-02-27 09:38:39', '2017-02-27 09:38:39'),
(44, 27, 'PHP', 2, '2017-02-27 09:38:39', '2017-02-27 09:38:39'),
(45, 27, 'Java', 3, '2017-02-27 09:38:39', '2017-02-27 09:38:39'),
(46, 27, 'C++', 4, '2017-02-27 09:38:39', '2017-02-27 09:38:39'),
(47, 27, 'Assembly', 5, '2017-02-27 09:38:39', '2017-02-27 09:38:39'),
(48, 27, 'OpenGL', 6, '2017-02-27 09:38:39', '2017-02-27 09:38:39'),
(49, 28, 'Node.JS', 1, '2017-02-27 09:39:41', '2017-02-27 09:39:41'),
(50, 28, 'PHP', 2, '2017-02-27 09:39:41', '2017-02-27 09:39:41'),
(51, 28, 'Java', 3, '2017-02-27 09:39:41', '2017-02-27 09:39:41'),
(52, 28, 'C++', 4, '2017-02-27 09:39:41', '2017-02-27 09:39:41'),
(53, 28, 'Assembly', 5, '2017-02-27 09:39:41', '2017-02-27 09:39:41'),
(54, 28, 'OpenGL', 6, '2017-02-27 09:39:41', '2017-02-27 09:39:41'),
(55, 29, 'OpenGL', 6, '2017-02-27 09:40:43', '2017-02-27 09:40:43'),
(56, 30, 'PHP', 2, '2017-02-27 10:27:56', '2017-02-27 10:27:56'),
(57, 30, 'Java', 3, '2017-02-27 10:27:56', '2017-02-27 10:27:56'),
(58, 30, 'C++', 4, '2017-02-27 10:27:56', '2017-02-27 10:27:56'),
(59, 31, 'Node.JS', 1, '2017-02-27 10:28:24', '2017-02-27 10:28:24'),
(60, 31, 'Java', 3, '2017-02-27 10:28:24', '2017-02-27 10:28:24'),
(61, 31, 'OpenGL', 6, '2017-02-27 10:28:24', '2017-02-27 10:28:24'),
(62, 32, 'Java', 3, '2017-02-27 10:28:53', '2017-02-27 10:28:53'),
(63, 32, 'Assembly', 5, '2017-02-27 10:28:53', '2017-02-27 10:28:53'),
(64, 32, 'OpenGL', 6, '2017-02-27 10:28:53', '2017-02-27 10:28:53'),
(65, 33, 'PHP', 2, '2017-02-27 10:29:25', '2017-02-27 10:29:25'),
(66, 33, 'Java', 3, '2017-02-27 10:29:25', '2017-02-27 10:29:25'),
(67, 33, 'C++', 4, '2017-02-27 10:29:25', '2017-02-27 10:29:25'),
(68, 34, 'Node.JS', 1, '2017-02-27 10:30:00', '2017-02-27 10:30:00'),
(69, 34, 'PHP', 2, '2017-02-27 10:30:00', '2017-02-27 10:30:00'),
(70, 34, 'C++', 4, '2017-02-27 10:30:00', '2017-02-27 10:30:00'),
(71, 35, 'Node.JS', 1, '2017-02-27 10:31:08', '2017-02-27 10:31:08'),
(72, 35, 'PHP', 2, '2017-02-27 10:31:08', '2017-02-27 10:31:08'),
(73, 35, 'Assembly', 5, '2017-02-27 10:31:08', '2017-02-27 10:31:08'),
(74, 36, 'Node.JS', 1, '2017-02-27 10:32:06', '2017-02-27 10:32:06'),
(75, 36, 'PHP', 2, '2017-02-27 10:32:06', '2017-02-27 10:32:06'),
(76, 36, 'C++', 4, '2017-02-27 10:32:06', '2017-02-27 10:32:06'),
(77, 36, 'Assembly', 5, '2017-02-27 10:32:06', '2017-02-27 10:32:06'),
(78, 36, 'OpenGL', 6, '2017-02-27 10:32:06', '2017-02-27 10:32:06'),
(79, 37, 'PHP', 2, '2017-02-27 10:32:53', '2017-02-27 10:32:53'),
(80, 37, 'Java', 3, '2017-02-27 10:32:53', '2017-02-27 10:32:53'),
(81, 37, 'C++', 4, '2017-02-27 10:32:53', '2017-02-27 10:32:53'),
(82, 38, 'Java', 3, '2017-02-27 10:33:33', '2017-02-27 10:33:33'),
(83, 38, 'C++', 4, '2017-02-27 10:33:33', '2017-02-27 10:33:33'),
(84, 38, 'Assembly', 5, '2017-02-27 10:33:33', '2017-02-27 10:33:33');

-- --------------------------------------------------------

--
-- Structure de la table `migrations`
--

CREATE TABLE IF NOT EXISTS `migrations` (
  `id` int(10) unsigned NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Contenu de la table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(6, '2014_10_12_000000_create_users_table', 1),
(7, '2014_10_12_100000_create_password_resets_table', 1),
(8, '2017_02_26_004401_create_competences2_table', 1),
(9, '2017_02_27_032553_create_profiles_table', 1),
(10, '2017_02_27_032640_create_competence_choisie_table', 1);

-- --------------------------------------------------------

--
-- Structure de la table `password_resets`
--

CREATE TABLE IF NOT EXISTS `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  KEY `password_resets_email_index` (`email`(191)),
  KEY `password_resets_token_index` (`token`(191))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `profiles`
--

CREATE TABLE IF NOT EXISTS `profiles` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `prenom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `matricule` int(11) NOT NULL,
  `expression` int(11) NOT NULL,
  `promotion` int(11) NOT NULL,
  `explication` int(11) NOT NULL,
  `structuration` int(11) NOT NULL,
  `vigilance` int(11) NOT NULL,
  `soutien` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=39 ;

--
-- Contenu de la table `profiles`
--

INSERT INTO `profiles` (`id`, `nom`, `prenom`, `matricule`, `expression`, `promotion`, `explication`, `structuration`, `vigilance`, `soutien`, `created_at`, `updated_at`) VALUES
(9, 'joel', 'yann', 9999999, 15, 25, 45, 75, 85, 60, '2017-02-27 09:14:34', '2017-02-27 09:14:34'),
(10, 'joel', 'yann2', 8888888, 60, 55, 85, 20, 10, 55, '2017-02-27 09:15:52', '2017-02-27 09:15:52'),
(11, 'joel', 'yann3', 7777777, 30, 90, 10, 55, 70, 25, '2017-02-27 09:16:37', '2017-02-27 09:16:37'),
(12, 'joel', 'yann4', 6666666, 60, 50, 40, 30, 20, 10, '2017-02-27 09:17:24', '2017-02-27 09:17:24'),
(13, 'joel', 'yann5', 5555555, 10, 20, 30, 40, 50, 60, '2017-02-27 09:18:13', '2017-02-27 09:18:13'),
(14, 'joel', 'yann6', 4444444, 100, 85, 75, 10, 95, 40, '2017-02-27 09:19:02', '2017-02-27 09:19:02'),
(15, 'Némart', 'Jean', 1234560, 93, 45, 34, 12, 76, 23, '2017-02-27 09:21:12', '2017-02-27 09:21:12'),
(16, 'Gratton', 'Bob', 1112233, 98, 89, 13, 22, 43, 9, '2017-02-27 09:22:02', '2017-02-27 09:22:02'),
(17, 'Martel', 'Sylvain', 4531122, 71, 96, 21, 9, 15, 32, '2017-02-27 09:23:28', '2017-02-27 09:23:28'),
(18, 'Levert', 'Pepe', 7676543, 65, 71, 56, 45, 99, 41, '2017-02-27 09:25:18', '2017-02-27 09:25:18'),
(19, 'Eldinero', 'Jaime', 1357900, 17, 25, 76, 87, 54, 98, '2017-02-27 09:28:16', '2017-02-27 09:28:16'),
(20, 'Gates', 'Steve', 8765432, 43, 89, 78, 77, 51, 4, '2017-02-27 09:29:46', '2017-02-27 09:29:46'),
(21, 'Jobs', 'Bill', 9876543, 97, 99, 66, 13, 9, 14, '2017-02-27 09:30:36', '2017-02-27 09:30:36'),
(22, 'Doe', 'John', 1010001, 32, 45, 98, 99, 35, 67, '2017-02-27 09:35:24', '2017-02-27 09:35:24'),
(23, 'Doe', 'Jane', 1110010, 54, 4, 43, 87, 24, 50, '2017-02-27 09:36:12', '2017-02-27 09:36:12'),
(24, 'Personne', 'Personna', 1234567, 10, 100, 10, 100, 10, 100, '2017-02-27 09:36:44', '2017-02-27 09:36:44'),
(25, 'Reacher', 'Jack', 7654321, 10, 20, 30, 40, 50, 60, '2017-02-27 09:37:35', '2017-02-27 09:37:35'),
(26, 'Jambon', 'Gros', 9999999, 99, 88, 11, 22, 11, 11, '2017-02-27 09:38:01', '2017-02-27 09:38:01'),
(27, 'Wick', 'John', 5148083, 50, 40, 30, 60, 70, 80, '2017-02-27 09:38:39', '2017-02-27 09:38:39'),
(28, 'Lee', 'Bruce', 1111111, 100, 100, 100, 100, 100, 100, '2017-02-27 09:39:41', '2017-02-27 09:39:41'),
(29, 'Norris', 'Chuck', 9999999, 10, 10, 10, 10, 100, 10, '2017-02-27 09:40:43', '2017-02-27 09:40:43'),
(30, 'Beaudoin', 'Mikaël', 29081240, 24, 67, 74, 45, 87, 45, '2017-02-27 10:27:56', '2017-02-27 10:27:56'),
(31, 'Bellemare-Alford', 'Loïc', 1923922, 23, 45, 24, 65, 87, 98, '2017-02-27 10:28:24', '2017-02-27 10:28:24'),
(32, 'Bergeron', 'Julien', 8743765, 24, 75, 98, 56, 87, 67, '2017-02-27 10:28:53', '2017-02-27 10:28:53'),
(33, 'Parenteau', 'Zoé', 1712872, 98, 65, 34, 57, 97, 56, '2017-02-27 10:29:25', '2017-02-27 10:29:25'),
(34, 'Bellemare-Alford', 'Daphnée', 84327834, 98, 93, 87, 85, 86, 89, '2017-02-27 10:30:00', '2017-02-27 10:30:00'),
(35, 'Huppé', 'Jérémy', 82147239, 76, 54, 97, 24, 56, 76, '2017-02-27 10:31:08', '2017-02-27 10:31:08'),
(36, 'Bayard', 'Nicolas', 9320230, 98, 52, 47, 22, 87, 26, '2017-02-27 10:32:06', '2017-02-27 10:32:06'),
(37, 'Rault', 'Alex', 2908234, 56, 45, 24, 57, 75, 65, '2017-02-27 10:32:53', '2017-02-27 10:32:53'),
(38, 'Roy', 'Nicolas', 192482, 54, 25, 71, 95, 24, 95, '2017-02-27 10:33:33', '2017-02-27 10:33:33');

-- --------------------------------------------------------

--
-- Structure de la table `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(10) unsigned NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
